# FilterDialog Properties

---
The FilterDialog type exposes the following members.
| Name| Description
---|---|---
| FilterToSelect|  The filter element to be selected once Show is invoked.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| NewFilterId|  The ElementId of the new filter created. The value is populated after Show method is executed.
| NewFilterName|  The name of the new ParameterFilterElement to be created and selected once Show is invoked.
Top
#### Reference
FilterDialog Class
Autodesk.Revit.UI Namespace